[
    {
           "title": "Part 1- Establishment of Commision on Human Right And Admistrative Justice",
           "sections": [
            {
                "section": "Section 1 - Establishment Of The Commission",
                "content": [
                    {
                        "sub_article":"There is established by this Act a body to be known as the Commission on Human Rights and Administrative Justice in this Act referred to as \"the Commission\".",
                        "aritle_list":[]

                }
                            ]
            },
            {
                "section":"Section 2 - Composition Of The Commission",
                "content": [
                    {
                        "sub_article":"(1) The Commission shall consist of",
                        "aritle_list":["(a) a Commissioner for Human Rights and Administrative Justice in this Act referred to as \"the Commissioner\"; and",
                                        "(b) two Deputy Commissioners for Human Rights and Administrative Justice, in this Act referred to as \"the Deputy Commissioners\"."]
                    },
                    {
                        "sub_article":"(2) The President shall, acting in consultation with the Council of State appoint the Commissioner and the Deputy Commissioners",
                        "aritle_list":""
                    }
                ]
            },
            {
                "section" :"Section 3 - Qualification Of Commissioners",
                "content":[
                    {
                        "sub_article":"(1) A person shall not be qualified for appointment as a Commissioner or a Deputy Commissioner for Human Rights and Administrative Justice, unless he is",
                        "aritle_list":["(a) in the case of the Commissioner, qualified for appointment as a Justice of the Court of Appeal; and",
                                    "(b) in the case of a Deputy Commissioner, qualified for appointment as a Justice of the High Court"]
                    },
                    {
                        "sub_article":"(2) The Commissioner and Deputy Commissioners shall not while holding office as Commissioners hold any other public office.",
                        "aritle_list":[]
                    }
                ]
            },
            {
                "section":"Section 4 - Terms And Conditions Of Service Of Commissioners",
                "content":[
                    {
                        "sub_article":"(1) The Commissioner and Deputy Commissioners shall enjoy the terms and conditions of service of a Justice of the Court of Appeal and High Court respectively.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) The Commissioner and Deputy Commissioners shall cease to hold office upon attaining the ages of seventy and sixty-five years respectively.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(3) Where the Commissioner or a Deputy Commissioner dies, resigns or is removed from office or is for any other reason unable to perform the functions of his office, the President shall, acting in consultation with the Council of State, appoint a person qualified to be appointed Commissioner or Deputy Commissioner to perform those functions until the appointment of a new Commissioner or Deputy Commissioner.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 5 - Removal Of Commissioners",
                "content":[
                    {
                        "sub_article":"The procedure for the removal of the Commissioner and Deputy Commissioners shall be the same as that provided for the removal of a Justice of the Court of Appeal and a Justice of the High Court respectively under article 146 of the Constitution.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 6 - Independence Of Commission And Commissioners",
                "content":[
                    {
                        "sub_article":"Except as provided by the Constitution or by any other law not inconsistent with the Constitution, the Commission and the Commissioners shall, in the performance of their functions not be subject to the direction or control of any person or authority.",
                        "aritle_list":[]
                     }
                ]
            }
           ]
    },
    {
        "title":"Part 2- Funtions of the Commission",
        "sections":[
            {
                "section":"Section 7 - Functions Of The Commission",
                "content":[
                    {
                        "sub_article":"The functions of the Commission are-",
                        "aritle_list":["(a) to investigate complaints of violations of fundamental rights and freedoms, injustice, corruption, abuse of power and unfair treatment of any person by a public officer in the exercise of his official duties;",
                                    "(b) to investigate complaints concerning the functioning of the Public Services Commission, the administrative organs of the State, the offices of the Regional Co-ordinating Council and the District Assembly, the Armed Forces, the Police Service and the Prisons Service in so far as the complaints relate to the failure to achieve a balanced structuring of those services or fair administration in relation to those services;",
                                    "(c) to investigate complaints concerning practices and actions by persons, private enterprises and other institutions where those complaints allege violations of fundamental rights and freedoms under the Constitution;",
                                    "(d) to take appropriate action to call for the remedying, correction and reversal of instances specified in paragraphs (a), (b) and (c) of this subsection through such means as are fair, proper and effective, including 3/4 : (i) negotiation and compromise between the parties concerned;, (ii) causing the complaint and its finding on it to be reported to the superior of an offending person;, (iii) bringing proceedings in a competent court for a remedy to secure the termination of the offending action or conduct, or the abandonment or alteration of the offending procedures; and, (iv) bringing proceedings to restrain the enforcement of such legislation or regulation by challenging its validity if the offending action or conduct is sought to be justified by subordinate legislation or regulation which is unreasonable or otherwise ultra vires;",
                                    "(e) to investigate allegations that a public officer has contravened or has not complied with a provision of Chapter Twenty-four (Code of Conduct for Public Officers) of the Constitution;",
                                    "(f) to investigate all instances of alleged or suspected corruption and the misappropriate steps, including reports to the Attorney-General and the Auditor-General, resulting from such investigation;",
                                    "(g) to educate the public as to human rights and freedoms by such means as the Commissioner may decide, including publications, lectures and symposia; and",
                                    "(h) to report annually to Parliament on the performance of its functions."
                                ]
                     },
                     {
                        "sub_article":"(2) All costs and expenses related to investigations conducted by the Commission into a complaint shall be borne by the Commission.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 8 - Special Powers Of Investigation",
                "content":[
                    {
                        "sub_article":"(1) The Commission shall for the purposes of performing its functions under this Act, have power-",
                        "aritle_list":["(a) to issue subpoenas requiring the attendance of any person before the Commission and the production of any document or record relevant to any investigation by the Commission;",
                                    "(b) to cause any person contemptuous of any such subpoena to be prosecuted before a competent court;",
                                    "(c) to question any person in respect of any subject matter under investigation before the Commission;",
                                    "(d) to require any person to disclose truthfully and frankly any information within his knowledge relevant to any investigation by the Commissioner."
                                ]
                     },
                     {
                        "sub_article":"(2) The Commissioner shall not investigate-",
                        "aritle_list":["(a) a matter which is pending before a court or judicial tribunal; or",
                                    "(b) a matter involving the relations or dealings between the Government and any other Government or an international organisation; or",
                                    "(c) a matter relating to the exercise of the prerogative of mercy."
                                ]
                     }
                ]
            },
            {
                "section":"Section 9 - Initiation Of Legal Proceedings",
                "content":[
                    {
                        "sub_article":"For the purposes of performing his functions under the Constitution, this Act and any other law, the Commissioner may bring an action before any court in Ghana and may seek any remedy which may be available from that court.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 10 - Regional And District Branches Of Commission",
                "content":[
                    {
                        "sub_article":"(1) There shall be established in each Region and District of Ghana Regional and District branches respectively of the Commission.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) There shall be appointed by the Commission an officer who shall be the head of a Regional or District branch of the Commission.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(3) The Commission may create such other lower structures as would facilitate its operations.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 11 - Functions Of Regional And District Representative Of Commission",
                "content":[
                    {
                        "sub_article":"(1) A representative of the Commission in a Regional or District office of the Commission shall",
                        "aritle_list":["(a) receive complaints from the public in the Region or District;",
                                    "(b) make such on-the-spot investigation as may be necessary; and",
                                    "(c) discharge any other duties relating to the functions of the Commission that may be assigned to him by the Commissioner."]
                     }
                ]
            }

            
        ]
    },
    {
        "title":"Part 3- Provisions Relating to Complaints and Investigations",
        "sections":[
            {
                "section":"Section 12 - Provisions Relating To Complaints",
                "content":[
                    {
                        "sub_article":"(1) A complaint to the Commission shall be made in writing or orally to the national offices of the Commission or to a representative of the Commission in the Regional or District branch.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) Where a complaint is made in writing it shall be signed by the complainant or his agent.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(3) Where a complaint is made orally, the person to whom the complaint is made shall reduce the complaint into writing and shall append his signature and the signature or thumbprint of the complainant.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(4) Notwithstanding any law to the contrary, where a letter written by",
                        "aritle_list":["(a) a person in custody; or",
                                    "(b) a patient in a hospital, is addressed to the Commission, it shall be immediately forwarded, unopened and unaltered to the Commission by the person for the time being in charge of the place or institution where the writer of the letter is detained or of which he is a patient."]
                     },
                     {
                        "sub_article":"(5) A complaint under this Act may be made by any individual or a body of persons whether corporate or unincorporated.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(6) Where a person by whom a complaint might have been made under this Act has died or is for any sufficient reason unable to act for himself, the complaint may be made by his personal representative or by a member of his family or other individual suitable to represent him.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 13 - Refusal To Investigate",
                "content":[
                    {
                        "sub_article":"(1) Where in the course of the investigation of any complaint it appears to the Commission-",
                        "aritle_list":["(a) that under the law or existing administrative practice there is adequate remedy for the complaint, whether or not the complainant has availed himself of it; or",
                                    "(b) that having regard to all the circumstances of the case, any further investigation is unnecessary, it may refuse to investigate the matter further."]
                     },
                     {
                        "sub_article":"(2) The Commission may refuse to investigate or cease to investigate any complaint",
                        "aritle_list":["(a) if the complaint relates to a decision, recommendation, act or omission of which the complainant has had knowledge for more than twelve months before the complaint is received by the Commission; or",
                                    "(b) if the Commission considers that , (i) the subject matter of the complaint is trivial;, (ii) the complaint is frivolous or vexatious or is not made in good faith; or ,(iii) the complainant does not have sufficient personal interest in the subject matter of the complaint."]
                     },
                     {
                        "sub_article":"(3) Notwithstanding subsection (2) of this section, if within six months after the Commission's refusal or ceasing to investigate any complaint under this section, fresh evidence in favour of the complainant becomes available, the Commission shall, at the request of the complainant, re-open the case.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(4) Where the Commission decides not to investigate or to cease to investigate a complaint, it shall within 30 days of the decision inform the complainant of its decision and the reasons for so refusing.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 14 - Procedure In Respect Of Investigations",
                "content":[
                    {
                        "sub_article":"(1) Where the Commission decides to conduct an investigation under this Act, it shall give the authority or person concerned and to any other person who is alleged in the complaint to have taken or authorised the act or omission complained of, an opportunity to comment on any allegations contained in the complaint and the representative of the authority or person concerned shall submit his comments within such time as the Commission may specify.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) The public may be excluded from investigations conducted by the Commission.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(3) Without prejudice to the generality of the provisions of this section, the Commission may obtain information from such persons and in such manner, and make such inquiries as it considers necessary.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(4) The Commission may pay to a person by whom a complaint is made and to any other person who attends and furnishes information for the purposes of an investigation under this Act-",
                        "aritle_list":["(a) sums in respect of expenses properly incurred by them; and",
                                    "(b) allowances by way of compensation for the loss of their time, in accordance with such scales and subject to such conditions as may be determined by the Commission having regard to the rates for the time being applicable to the courts."]
                     }
                ]
            },
            {
                "section":"Section 15 - Evidence At Investigations",
                "content":[
                    {
                        "sub_article":"(1) Subject to this section the Commission may require any person who, in its opinion, is able to give any information relating to a matter being investigated by the Commission-",
                        "aritle_list":["(a) to furnish the information to it;",
                                    "(b) to produce any document, paper or thing that in its opinion relates to the matter being investigated and which may be in the possession or control of that person."]
                     },
                     {
                        "sub_article":"(2) The Commission may summon before it and examine on oath or affirmation;",
                        "aritle_list":["(a) a person required to give information or produce anything under subsection (1) of this section;",
                                    "(b) a complainant;",
                                    "(c) any other person who the Commission considers will be able to give information required under subsection (1) of this section."]
                     },
                     {
                        "sub_article":"(3) Subject to subsection (4) of this section, a person who is bound by law to maintain secrecy in relation to, or not to disclose, any matter may not ",
                        "aritle_list":["(a) supply information to or answer a question put by the Commission in relation to that matter; or",
                                        "(b) produce to the Commission a document, paper or thing relating to it, if compliance with that requirement would be in breach of the obligation of secrecy or non-disclosure."]
                     },
                     {
                        "sub_article":"(4) A person to whom subsection (3) of this section applies may be required by the Commission to supply information or answer a question or produce a document, paper or thing that relates to a matter under investigation; and subject to section 16 of this Act, it shall be the duty of that person to comply with the requirement.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(5) A witness before the Commission shall be entitled to the same privileges to which he would have been entitled if he were a witness before the High Court.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(6) No person shall be liable to prosecution for an offence under any enactment by reason of his compliance with a requirement of the Commission under this section",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 16 - Production Of Official Documents",
                "content":[
                    {
                        "sub_article":"Article 135 of the Constitution which relates to production of official documents in court shall apply to proceedings before the Commission as it applies to proceedings before a court.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 17 - Maintenance Of Secrecy",
                "content":[
                    {
                        "sub_article":"(1) The Commissioner or a Deputy Commissioner and every person holding an office or appointment under the Commission shall maintain secrecy in respect of all matters that come to their knowledge in the exercise of their functions.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) Every person holding office or appointment under the Commission who is likely to have access to confidential information of the Commission shall before proceeding to carry out his functions under this Act, take and subscribe to the Oath of Secrecy set out in the Second Schedule to the Constitution.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(3) The Commission shall determine the category of persons to whom subsection (2) of this section shall apply.",
                        "aritle_list":[]
                     }
                ]
            }

            
        ]
    },
    {
        "title":"Part 4- Procedure after Investigation By the Commission",
        "sections":[
            {
                "section":"Section 18 - Procedure After Investigations",
                "content":[
                    {
                        "sub_article":"(1) Where after making an investigation under this Act, the Commission is of the view that the decision, recommendation, act or omission that was the subject matter of the investigation -",
                        "aritle_list":["(a) amounts to a breach of any of the fundamental rights and freedoms provided in the Constitution; or",
                                        "(b) appears to have been contrary to law; or",
                                        "(c) was unreasonable, unjust, oppressive discriminatory or was in accordance with a rule of law or a provision of any Act or a practice that is unreasonable, unjust, oppressive, or discriminatory; or",
                                        "(d) was based wholly or partly on a mistake of law or fact; or",
                                        "(e) was based on irrelevant grounds or made for an improper purpose; or",
                                        "(f) was made in the exercise of a discretionary power and reasons should have been given for the decision, the Commission shall report its decision and the reasons for it to the appropriate person, Minister, department or authority concerned and shall make such recommendations as it thinks fit and the Commission shall submit a copy of its report and recommendations to the compliant."]
                     },
                     {
                        "sub_article":"(2) If within three months after the report is made no action is taken which seems to the Commission to be adequate and appropriate, the Commissioner, may after considering the comments, if any, made by or on behalf of the department, authority or person against whom the complaint was made, bring an action before any court and seek such remedy as may be appropriate for the enforcement of the recommendations of the Commission.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 19 - Reports Of Commissioner",
                "content":[
                    {
                        "sub_article":"(1) The Commissioner shall, annually submit a report to Parliament which shall include a summary of the matters investigated, and the action taken on them by the Commission during the preceding year.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) Parliament may debate the report of the Commission and may pass such resolution as it considers fit.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(3) A resolution of Parliament shall not alter a decision made by a court on a matter instituted before the court by the Commissioner.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(4) The Commissioner may, in the public interest or in the interest of any person or department or any other authority, publish reports relating;",
                        "aritle_list":["(a) generally to the exercise of the functions of the Commission under this Act; or",
                                        "(b) to any particular case investigated by the Commission whether or not the matters in the report have been the subject of a report to Parliament."]
                     }
                ]
            }
            
        ]
    },
    {
        "title":"Part 5- Miscellaneous Provision",
        "sections":[
            {
                "section":"Section 20 - Appointment Of Staff",
                "content":[
                    {
                        "sub_article":"The appointment of officers and other employees of the Commission shall be made by the Commission acting in consultation with the Public Services Commission.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 21 - Expenses Of Commission Charged On Consolidated Fund",
                "content":[
                    {
                        "sub_article":"The administrative expenses of the Commission including all salaries, allowances and pensions payable to or in respect of, persons serving with the Commission are charged on the Consolidated Fund.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 22 - Proceedings Privileged",
                "content":[
                    {
                        "sub_article":"(1) Subject to the supervisory jurisdiction of the Supreme Court, no proceedings shall lie against the Commission or against any person holding an office or appointment under the Commission for anything done, reported or said by him in the course of the exercise or intended exercise of his functions under this Act, unless it is shown that he acted in bad faith.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) Anything said, any information supplied, or any document, paper or thing produced by any person in the course of an inquiry by or proceedings before the Commission under this Act is privileged in the same manner as if the inquiry or proceedings were proceedings in a court.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(3) For the purposes of the rules of law relating to defamation any report made by the Commission under this Act shall be privileged, and a fair and accurate report on it in a newspaper or a broadcast shall also be privileged.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 23 - Entry Of Premises",
                "content":[
                    {
                        "sub_article":"For the purposes of this Act, the Commissioner or any public officer authorized by him, may at any time enter any premises occupied by a department, authority or a person to whose act or omission this Act applies and inspect the premises and, subject to sections 16 and 17 of this Act carry out on the premises any investigation that is within the jurisdiction of the Commission.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 24 - Offences And Penalties",
                "content":[
                    {
                        "sub_article":"Any person who -",
                        "aritle_list":["(a) without lawful justification or excuse, wilfully obstruct, hinders or resists a member of the Commission or an officer authorised by the Commissioner in the exercise of any powers under this Act; or",
                                        "(b) without lawful justification or excuse, refuses or wilfully fails to comply with any lawful request of the Commissioner or a Deputy Commissioner or any other person under this Act; or",
                                        "(c) wilfully makes any false statement to or misleads or attempts to mislead the Commissioner or any other person in the exercise of his functions under this Act, commits an offence and is liable on summary conviction to a fine not exceeding ₵500,000.00 and in default of payment to imprisonment for a term not exceeding six months or to both."]
                     }
                ]
            },
            {
                "section":"Section 25 - Provisions Of This Act To Be In Addition To Provisions Of Any Other Law",
                "content":[
                    {
                        "sub_article":"The provisions of this Act are in addition to the provisions of any other Act or any rule of law under which",
                        "aritle_list":["(a) a remedy or right of appeal or objection is provided for any person; or",
                                        "(b) any procedure is provided for the inquiry into or investigation of any matter, and nothing in this Act shall be taken to limit or affect a remedy or right of appeal or objection or procedure."]
                     }
                ]
            },
            {
                "section":"Section 26 - Regulations",
                "content":[
                    {
                        "sub_article":"(1) Subject to the provisions of the Constitution and to any Act of Parliament made under the Constitution, the Commission shall make, by constitutional instrument, regulations regarding the manner and procedure for bringing complaints before it and the investigation of such complaints.",
                        "aritle_list":[]
                     },
                     {
                        "sub_article":"(2) The exercise of the power to make regulations may be signified under the hand of the Commissioner or in his absence, a Deputy Commissioner.",
                        "aritle_list":[]
                     }
                ]
            },
            {
                "section":"Section 27 - Interpretation",
                "content":[
                    {
                        "sub_article":"In this Act a reference to a member of a complainant's family means-",
                        "aritle_list":["(a) in the case of a person belonging to a family based on the paternal system-mother, father, wife, son, daughter, brother, sister, father's brother, father's father, father's brother's son, and brother's son;",
                                        "(b) in the case of a person belonging to a family based on the maternal system-mother, father, wife, son, daughter, brother, sister, mother's mother, mother's brother, mother's sister, sister's son, sister's daughter, mother's sister's son and mother's sister's daughter."]
                     }
                ]
            },
            {
                "section":"Section 28 - Repeal And Saving",
                "content":[
                    {
                        "sub_article":"(1) The Ombudsman Act, 1980 (Act 400) is repealed.",
                        "aritle_list":[]
                     },
                    {
                       "sub_article":"(2) Notwithstanding the repeal of the Ombudsman Act, 1980 (Act 400)",
                       "aritle_list":["(a) any regulation made under it and in force on the coming into force of this Act shall until altered, amended or revoked, continue in force and shall be applied with such modifications as may be necessary for giving effect to the provisions of this Act; and",
                                    "(b) any complaint pending before the Ombudsman immediately before the coming into force of this Act may be proceeded with under, and shall be subject to the provisions of, this Act."]
                    }
                ]
            }

            
        ]
    }
 

]
